<?php

class Sova {
  public $data = [
    "Как говорил мой папаша: хочешь незаметно дёрнуть ручник, залезь под одеяло ",
    "Носороги - это единственные кто попал в красную книгу через постель ",
    "О, шишка ",
    "Сова: Мне нужны имена!\nЛемурзин: Никитка, Эдуард, Гульнара.",
    "— Сука, тварь, скотина, ублюдок конченный\n- Не понял, нафига он мне вас презентовал? Совсем от безделья крыша поехала ",
    "— Билет!\n— На-а балет!\n— И нафига я этот костюм Корнелюка шил? Его же даже старухи не помнят!\n",
    "— И анекдот мой смешной был, понятно? ",
    "— Ээй, было бы у меня раньше столько резины, может и ты бы никогда не родился, сынок. ",
    "— Да я просто будильник забыл... купить ",
    "— Привет, Сова! А почему ты за мной не заехал?\n- Да я просто забил... Ой то есть забыл... На тебя",
    "— Тут, короче, такая ситуация: актёр, который играл лягушку, немножко... умер ",
    "— Давай, пробей мне лося ",
    "— Эй, Сова, просто Слон стал импотентом и ушёл с работы, а моя мама теперь главная в участке.\n— А я был весь хрустальный и меня разыгрывали в каком-то интеллектуальном казино. Давайте теперь все расскажем, кому что приснилось?\n",
    "— Да ну в жопу, здесь не получится ничего смешного.\n— Хаха, жопа.\n— Заткнись, Харламов!\n— Я те щас заткнусь!\n— О-ой, шеф, это вы? И-извините.",
    "— Грибы принес...?\n- Нет, я принес горшок\n- Клааасс, прям обосраться можно, или цветок посадить",
    "— Ну а теперь давайте узнаем, кто больше понравился зрителям.\n— Илья!\n— Конечно Илья!\n— Илья.\n— Мама, папа, вы-то куда?\n— Прости, сынок. Но ты реально всасываешь.\n\n",
    "— Слушай, Петух. Я хотел перед тобой извиниться.\n— За что?\n— Ну, я не знаю. Просто в конце добрых сериалов всегда все извиняются, осознают свои ошибки и всё такое.\n— Тебе не за что извиняться, Сова.\n— Ну тогда пошёл нах*й!\n— Что?\n— А я это специально сказал, чтобы было за что извиниться.\n— ...\n— Ну и... почему ты не извиняешься?\n— А потому что время серии уже закончилось. Иди нах*й.\n\n",
    "— И за то, что мы такие молодцы, нам подняли зарплату... На четыре колбасы. ",
    "— Всем не двигаться, это ограб.... Ленин! А ну быстро отдали деньги народу! ",
    "— Эй, противогаз! Жми на противотормоз. Ты арестован. ",
    "— Сова, где мы?\n— Ну, судя по тому, что я Соваленок, а ты Свиньякорь, мы во сне сценариста-каламбурщика. Смотри, тут же все звёзды: Лама Крофт, Никоалас Кейдж и известнейший дуэт Черепушкин Ниндзя и Черепашка Няньдзя! ",
    "— Аааа! Мы все умрём в этой виртуальной реальности!\n— Дай угадаю твою очередную несмешную шутку. Ты сейчас типа размазня, да?\n— Нет, шеф. Я цитоплазма. Мы ж типа в клетке.",
    "— в общем, он умер от щекотки, или если другими словами: привет Артёмка, как дела? Ну это если совсем другими словами. ",
    "— Как говорил мой глухой инструктор по стрельбе: Что?",
    "— Су-у-ка-а, мне нельзя на небеса, там же запрещено матери-и-иться!",
    "— Это нужно, чтобы стать приманкой.\n— Нет, это плохая идея. У меня как-то встал при мамке, она меня наказала.",
    "— Мишка косолапый, по лесу идёт... ШИИИШКИ собирает, песенки поет ",
    "— Эй, Горилла, предагаю бой.\n— Какой?\n— Этот стол с твоей губой.",
    "— Первый бой сейчас начнётся, целуй жену на удачу и пойдём.\n— Эээ... Не-е-ет. Нам до свадьбы нельзя. До... золотой свадьбы. Поэтому вместо поцелуев мы посылаем друг друга нах*й. Иди нах*й, свинья.\n— И ты иди нах*й, милый.\n— Если я не вернусь, передай детям, чтобы тоже шли нах*й.\n\n— В этой серии министерство культуры потребовало от нас, чтобы мы сделали пропаганду семейных ценностей. И мы, конечно же... послали их нах*й.",
    "— Как вы поняли, над шутками Синички и Павлина работал один и тот же сценарист. мы ему зарплату выдали сразу проститутками, потому что знаем, на что он её потратит.",
    "— Чтобы злость выходила проще, вот тебе сборник раннего Линкин Парка.",
    "— Да пошёл ты в транду.",
    "— Чтоб не сдохнуть от тоски\nМы берём соски в тиски\nМы берём соски в тиски\nЛа-ла-ла-ла.",
    "— И зачем тебе этот тренер?\n— Как говорится, хочешь идти быстро — иди один. Хочешь идти далеко — иди с кем-то. Мне надо было далеко.\n— Сказал бы мне, я бы тебя далеко послал!",
    "— Лемурзин, просверли мне башку, Лемурзин\nПросверли башку мне наскозь.\nГлубоко, где затылка кончается кость\nТы войдёшь огромным сверлом.",
    "— Сосуна туэлерте. Капитулате микроне умана синта чита дрита пипипи сосиска ляляляляляляля э.",
    "— Хехехехе, привет. сссука, хочешь кор-р-р-аблик? ",
    "— Тогда скажи, как по английски будет \"мне нужна помощь\"?\n- Да хуй его знает\n- Алло, Бен, это Данила, да хуй его знает ",
    "— Там за горами из подушек\nМаленькая сова ",
    "— Это пастырь Анатолий.\n— Называйте меня Толик. Кот Толик. Католик. ",
    "— Тррр, ля паркур тужур ",
    "— Ваш нос похож на вялый чле...\n— Да я поняла!",
    "— Я же говорил, что Дракузин звучит как лекарство от запора",
    "— горбатый, я сказал горбатый!\n- кто не работает, тот ест\n- ?\n- что? Я только эту крутую цитату из советских фильмов знаю",
    "— Братство долгойогов",
    "— Я так понимаю, Джон Уик?\n- Джон Уи-Уи-Уик, и убийство у меня в крови\n- Да хватит своим диабетом выпендриваться, Свинья",
    "— Господи, ну почему они хотят нас убить? Мы же им попки лизали!",
    "— Аааааа! *стреляет*\n- Сова, что ты творишь?\n- мне просто показалось... что у меня слишком много патронов",
    "— Так, пошли все отсюда к чёртовой матери!\n— А, простите, шеф, а где живёт эта женщина?",
    "— Господи, какой же ты сказочный *****!\n— Подождите, а зачем вы задудели слово \"Бобёр\"?\n— Да потому что этот ***** хуже, чем все ***** вместе взятые!",
    "Лемурзин: Круассан экзюпери\nПереводчик: Здравствуйте!",
    "— Передайте, пожалуйста, господину Бонапарту, что за ограбление ТЮЗа мы его даже в тюрьму не посадим! Тем более, у нас уже есть один псих, так что... А-аревуар.",
    "— Сова, ты опять взялся за старое?\n— Ну, во-первых, это не ваше дело, а во-вторых моя соседка не такая уж и старая.",
    "— Я предупреждаю, я бывший морской котик.\n— Ага, а я действующая сухопутная медуза.",
    "Подозрительная сова желает всем читателям не болеть и не курить много шишек. Всем мира!",
    "— И, наконец, все мы сегодня поняли, что чем больше героев участвует в серии, тем меньше слов у Лося.",
    "Британские учёные скрестили крабовые палочки и получили крабовые крестики",
    "Пацаны, там 8 сезон",
    "— извините, у меня зазвонил телефон. Кто говорит?\n- слон\n- что вам надо? Шоколада? Хехехе. Твою мать.\n- Алло, свинья, позови шефа\n- Скажи ему пусть идёт нахуй",
    "— Отсоси, Пососейдон!",
    "— Прости, Сова. Я тебя любить, а твоя ревность хорошо, как свежий плод.\n\n...\n\n- Эээ.. Просто последнюю фразу для Синички писал узбекский сценарист, которого мы потом сразу уволили. Не обращайте внимание, короче.",
    "Короче, привязали обсуждение, давайте болтать на Совином",
    "— Хааа! У меня усы и я квадратный. Я Куб Ович",
    "Мы — это веник",
    "— Своими шутками я сделал невозможное — поджёг пукан самому богу воды!",
    "А ещё ты можешь увеличить член,\nЧтобы был побольше, прямо до колен,\nПри моём масштабе это не большой\nПростите, что испортил этот выпускной.",
    "— А Вы точно не первый день здесь работаете?\n— Ты видишь, как долго я ссу?\n— Ну да.\n— Так могут только боги... и водопады. Я похож на водопад?\n— Вы больше похожи на сумасшедшего, который любит идиотские аналогии.",
    "— Лучше быть конченым, чем приконченным.",
    "ПРОТИВОТАНКОВЫЕ МИМЫ",
    "— Да как вы себя ведёте? Вы же полиция! — Кто жополицые?"
  ];

  public function __construct() {
  }

  public function random() {
    return $this->data[array_rand($this->data)];
  }
}

function sova() {
  return new Sova();
}
